app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def set_category
    @category = Category.find_by_id!(params[:id])