app/controllers/products_controller.rb

  def add_to_favourite
    @product.change_status(true)
    respond_to do |format|
      if @product.save
---
UPDATE "products" SET "favourite" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["favourite", "t"], ["updated_at", "2019-01-30 01:42:30.127685"], ["id", 5]]

  def remove_from_favourite
    @product.change_status(false)
    respond_to do |format|
      if @product.save
---
UPDATE "products" SET "favourite" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["favourite", "f"], ["updated_at", "2019-01-31 00:50:57.246295"], ["id", 5]]

  def create
    @product = Product.new(product_params)
    @product.category = @category

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "price", "quantity", "discount", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "sansnsan"], ["price", 100.0], ["quantity", 50], ["discount", 20.0], ["category_id", 4], ["created_at", "2019-01-31 01:32:06.918721"], ["updated_at", "2019-01-31 01:32:06.918721"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "name" = ?, "quantity" = ?, "favourite" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Xioami A2 256G"], ["quantity", 100], ["favourite", "t"], ["updated_at", "2019-02-02 01:38:28.270657"], ["id", 18]]

  def set_category
    @category = Category.find(params[:category_id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]