app/views/products/_form.html.erb

SELECT  "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
        <div class="input-field col s12">
          <%= form.select :category_id, Category.all.map { |cat| [cat.name, cat.id] }, class: 'validate' %>